{
  "title": "Хоббит, или туда и обратно",
  "subtitle": "Интерактивное путешествие по Средиземью с искусственным интеллектом",
  "startGame": "Начать путешествие",
  "startGameHint": "Ваше приключение начнется в уютной норе Бэг-Энд...",
  "returnToGame": "Вернуться к игре",
  "returnToGameHint": "Продолжить ваше текущее приключение",
  "startNewGame": "Начать новую игру",
  "startNewGameWarning": "⚠️ Это удалит текущий прогресс!",
  "confirmNewGame": "Вы уверены, что хотите начать новую игру? Текущий прогресс будет утерян.",
  
  "sections": {
    "what": {
      "title": "Что это за игра?",
      "description1": "Вы управляете Бильбо Бэггинсом в его невероятном путешествии по миру Толкиена. Искусственный интеллект выступает в роли мастера игры, создавая живые диалоги и реакции персонажей в стиле великого писателя.",
      "description2": "Каждое ваше действие влияет на историю. Мир запоминает ваши поступки, персонажи развиваются, а время течет реалистично. Это не просто игра — это живая история, которую вы пишете вместе с ИИ."
    },
    
    "bilbo": {
      "title": "Как ведет себя Бильбо?",
      "personality": "Бильбо — не безвольная марионетка, а живой персонаж со своими чертами характера:",
      "trait1": "🏠 **Домосед**: предпочитает уют и покой дальних странствий",
      "trait2": "🧠 **Воля**: может быть решительным или нерешительным в зависимости от ваших действий",
      "trait3": "💭 **Осторожность**: думает прежде чем действовать, может отказаться от безрассудных поступков",
      "trait4": "📚 **Развитие**: становится смелее через испытания, но может потерять волю из-за неудач"
    },
    
    "howto": {
      "title": "Как играть?",
      "step1": {
        "title": "Опишите намерение",
        "description": "Напишите, что хочет сделать Бильбо. ИИ переформатирует это в стиле Толкиена:",
        "example": "хочу поздороваться с гостем → Бильбо вежливо кланяется и говорит: — Добро пожаловать в Бэг-Энд!"
      },
      "step2": {
        "title": "Мир отвечает",
        "description": "ИИ опишет реакцию мира, обновит состояние игры и продолжит историю:",
        "example": "Гэндальф улыбается под широкополой шляпой и отвечает низким голосом..."
      }
    },
    
    "features": {
      "title": "Особенности игры",
      "will": {
        "title": "Система воли",
        "description": "Воля Бильбо влияет на его поведение. Смелые поступки укрепляют волю, трусость — ослабляет."
      },
      "time": {
        "title": "Живое время",
        "description": "Время течет реалистично: разговоры занимают минуты, путешествия — дни, отдых — целые сезоны."
      },
      "memory": {
        "title": "Память мира",
        "description": "Персонажи помнят ваши поступки, мир развивается, а важные события сохраняются навсегда."
      }
    }
  }
}