{
  "title": "The Hobbit, or There and Back Again...",
  "subtitle": "Interactive journey through Middle-earth with artificial intelligence",
  "startGame": "Begin the Journey",
  "startGameHint": "Your adventure will begin in the cozy hobbit-hole of Bag End...",
  "returnToGame": "Return to Game",
  "returnToGameHint": "Continue your current adventure",
  "startNewGame": "Start New Game",
  "startNewGameWarning": "⚠️ This will delete current progress!",
  "confirmNewGame": "Are you sure you want to start a new game? Current progress will be lost.",
  
  "sections": {
    "what": {
      "title": "What is this game?",
      "description1": "You play as Bilbo Baggins on his incredible journey to the Lonely Mountain with the dwarves and the wizard Gandalf. AI acts like a game master, creating realistic responsive reactions to your actions.",
      "description2": "But remember: you cannot directly control Bilbo, you only set the direction of his thoughts, and how he behaves depends on his hobbit soul..."
    },
    
    "bilbo": {
      "title": "How does Bilbo behave?",
      "personality": "Watch Bilbo's state and will carefully!",
      "trait1": "💖 State determines his emotional experiences and his interpretation of your guidance.",
      "trait2": "🧠 Will determines whether he can control himself, resist weaknesses and perceive your guidance."
    },
    
    "howto": {
      "title": "How to play?",
      "step1": {
        "title": "Write intention",
        "description": "Write what Bilbo wants to do, and Bilbo will try to do it...",
        "example": "want to greet the guest → Bilbo politely bows and says: — Welcome to Bag End!"
      },
      "step2": {
        "title": "World responds",
        "description": "AI will describe the world's reaction, update the game state and continue the story:",
        "example": "Gandalf smiles beneath his wide-brimmed hat and replies in a low voice..."
      }
    },
    
    "features": {
      "title": "Game features",
      "will": {
        "title": "Will system",
        "description": "Bilbo's will affects his behavior. Brave deeds strengthen will, cowardice weakens it."
      },
      "time": {
        "title": "Living time",
        "description": "Time flows realistically: conversations take minutes, journeys take days."
      },
      "memory": {
        "title": "World memory",
        "description": "Characters remember your deeds, the world develops, and important events are preserved forever."
      },
      "therapy": {
        "title": "Therapy",
        "description": "The game is meditative and very fun!"
      }
    }
  }
}