{
  "title": "The Hobbit, or There and Back Again...",
  "subtitle": "Interactive journey through Middle-earth with artificial intelligence",
  "startGame": "Begin the Journey",
  "startGameHint": "Your adventure will begin in the cozy hobbit-hole of Bag End...",
  "returnToGame": "Return to Game",
  "returnToGameHint": "Continue your current adventure",
  "startNewGame": "Start New Game",
  "startNewGameWarning": "⚠️ This will delete current progress!",
  "confirmNewGame": "Are you sure you want to start a new game? Current progress will be lost.",
  
  "sections": {
    "what": {
      "title": "What is this game?",
      "description1": "You control Bilbo Baggins on his incredible journey through Tolkien's world. Artificial intelligence serves as the game master, creating living dialogues and character reactions in the style of the great writer.",
      "description2": "Every action you take affects the story. The world remembers your deeds, characters develop, and time flows realistically. This isn't just a game — it's a living story that you write together with AI."
    },
    
    "bilbo": {
      "title": "How does Bilbo behave?",
      "personality": "Bilbo is not a mindless puppet, but a living character with his own personality traits:",
      "trait1": "🏠 **Homebody**: prefers comfort and peace over distant wanderings",
      "trait2": "🧠 **Will**: can be decisive or indecisive depending on your actions",
      "trait3": "💭 **Caution**: thinks before acting, may refuse reckless deeds",
      "trait4": "📚 **Growth**: becomes braver through trials, but may lose will due to failures"
    },
    
    "howto": {
      "title": "How to play?",
      "step1": {
        "title": "Describe intention",
        "description": "Write what Bilbo wants to do. AI will reformat it in Tolkien's style:",
        "example": "want to greet the guest → Bilbo politely bows and says: — Welcome to Bag End!"
      },
      "step2": {
        "title": "World responds",
        "description": "AI will describe the world's reaction, update the game state and continue the story:",
        "example": "Gandalf smiles beneath his wide-brimmed hat and replies in a low voice..."
      }
    },
    
    "features": {
      "title": "Game features",
      "will": {
        "title": "Will system",
        "description": "Bilbo's will affects his behavior. Brave deeds strengthen will, cowardice weakens it."
      },
      "time": {
        "title": "Living time",
        "description": "Time flows realistically: conversations take minutes, journeys take days, rest takes entire seasons."
      },
      "memory": {
        "title": "World memory",
        "description": "Characters remember your deeds, the world develops, and important events are preserved forever."
      }
    }
  }
}